app/Controllers/WebMaster/App/AppAjax.php

SELECT *
FROM `app`
WHERE `app`.`id` = '1'
SELECT *
FROM `page`
WHERE `app_id` = '1'
ORDER BY `label`
---
    public function getPages($appId){
		$appModel = new AppModel();
		$app = $appModel->asObject()->find($appId);
        if($app == null){
            return $this->statusNotFound('No app for id=' . $appId);
        }
        $pageModel = new PageModel();
        $allPages = $pageModel->asObject()->where('app_id', $appId)->orderBy('label')->find();

SELECT *
FROM `page`
WHERE `page`.`id` = '1'
---
    public function getElements($pageId, $langId){
        $page = (new PageModel())->asObject()->find($pageId);

SELECT *
FROM `element`
WHERE `element`.`id` = '6'
---
    public function getElement($elementId) {
        $element = (new ElementModel())->asObject()->find($elementId);

SELECT *
FROM `app`
WHERE `id` = '1'
AND `owner_id` = '2'
 LIMIT 1
SELECT *
FROM `page`
WHERE `app_id` = '1'
AND `path` = '/index.php'
 LIMIT 1
SELECT *
FROM `lang`
WHERE `code` = 'en'
 LIMIT 1
---
    public function getJson($appId){
        $userId = session()->get('user_id');
        $app = (new AppModel())->asObject()
            ->where('id', $appId)
            ->where('owner_id', $userId)
            ->first();
        if($app == null) {
            return $this->statusNotFound("No app with id=" . $appId);
        }
        $pageUrl = $this->request->getGet('path');
        $page = (new PageModel())
            ->where('app_id', $appId)
            ->where('path', $pageUrl)
            ->asObject()->first();
        if($page == null) {
            return $this->statusNotFound("No page with path=" . $pageUrl);
        }

        $langCode = $this->request->getGet('lang');
        $lang = (new LanguageModel())->asObject()
            ->where('code', $langCode)
            ->asObject()->first();