app/Controllers/WebMaster/App/Editapp.php

	public function index($id){

		if(session()->get('user_id') == "") {
			return redirect()->to('welcome/index');
		}

		helper(['form', 'database']);
		$appModel = new \App\Models\AppModel();
		$data['app'] = $appModel->asObject()->find($id);
---
SELECT *
FROM `app`
WHERE `app`.`id` = '1'