app/Controllers/WebMaster/App/Listapps.php

SELECT *
FROM `app`
WHERE `owner_id` = '2'
ORDER BY `name` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `app`
WHERE `owner_id` = '2'
---
	public function index($orderBy = null, $asc = null, $offset = 0){

		if(session()->get('user_id') == "") {
			return redirect()->to('welcome/index');
		}

		helper(['database']);

		// preparer le tri
		if($orderBy == null) {
			$orderBy = 'name';
		}
		if($asc == null) {
			$asc = 'asc';
		}
		$data['orderBy'] = $orderBy;
		$data['asc'] = $asc;
		$limit = 10;
		// $pager = \Config\Services::pager();
		// recuperation des donnees
		$userId = session()->get('user_id');
		$appModel = new \App\Models\AppModel();

		$data['apps'] = $appModel->asObject()->where('owner_id', $userId)
			->orderBy($orderBy, $asc)->paginate($limit, 'bootstrap', null, $offset);